       IDENTIFICATION DIVISION.
       PROGRAM-ID. TP2.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
	      DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
		SELECT  VTAS-SEC ASSIGN TO "ARCH-2\VTASSEC.TXT" 
				ORGANIZATION IS LINE SEQUENTIAL
				FILE STATUS IS FS-VTAS-SEC.
				
		SELECT  VTAS-INDEX	ASSIGN TO "ARCH-2\VTASIDX.DAT" 
				ORGANIZATION IS INDEXED
				ACCESS MODE IS DYNAMIC
				RECORD KEY IS VTAS-INDEX-CLAVE
				FILE STATUS IS FS-VTAS-INDEX.
		
		SELECT	VTAS-ORD ASSIGN TO DISK.
				
		SELECT   LISTADO	ASSIGN TO "ARCH-2\LISTADO.TXT" 
			ORGANIZATION IS LINE SEQUENTIAL.		
       
	   DATA DIVISION.
       FILE SECTION.

       FD  VTAS-SEC. 
       01  VTAS-SEC-REG.
		   03 VTAS-TIPO-IDENT			PIC 9(01).
		   03 VTAS-IDENT-CLI			PIC 9(11).
		   03 VTAS-SEC-FECHA			PIC X(10).
		   03 VTAS-SEC-COD-MICRO		PIC 9(06).
		   03 VTAS-SEC-COD-TRAMO		PIC 9(04).
		   03 VTAS-SEC-FECHA-PART		PIC X(10).
		   03 VTAS-SEC-HORA-PART		PIC X(05).
		   03 VTAS-SEC-IMPORTE			PIC 9(04)V99.

       FD	VTAS-INDEX. 
       01  VTAS-INDEX-REG.
		   03 VTAS-INDEX-CLAVE.
			   05 VTAS-INDEX-CUIT-CLI		PIC 9(11).
			   05 VTAS-INDEX-FECHA			PIC X(10).
			   05 VTAS-INDEX-NRO-VTA-CLI	PIC 9(03).
		   03 VTAS-INDEX-IMPORTE			PIC 9(06)V99.
		   
	   SD  VTAS-ORD.
	   01  VTAS-ORD-REG.
		   03 VTAS-ORD-CLAVE.	
			   05 VTAS-ORD-RAZON		PIC X(30).
			   05 VTAS-ORD-FECHA		PIC X(10).
			   05 VTAS-ORD-NRO-VTA		PIC 9(03).
			   05 VTAS-ORD-COD-MICRO	PIC 9(06).
			   05 VTAS-ORD-COD-TRAMO	PIC 9(04).
			   05 VTAS-ORD-FECHA-PART	PIC X(10).
			   05 VTAS-ORD-HORA-PART	PIC X(05).
		   03 VTAS-ORD-CUIT-CLI			PIC 9(11).
		   03 VTAS-ORD-DOMICILIO		PIC X(30).
		   03 VTAS-ORD-IMPORTE			PIC 9(06)V99.
		   03 VTAS-ORD-PORC-DESC		PIC 9(06)V99.
		   
	   FD LISTADO.
	   01 LINEA							PIC X(80).
		   
       WORKING-STORAGE SECTION.

       01  FS-VTAS-SEC					PIC X(02).
           88  FS-VTAS-SEC-OK           VALUE '00'.
           88  FS-VTAS-SEC-FIN          VALUE '10'.

	   01  FS-VTAS-INDEX				PIC X(02).
           88  FS-VTAS-IND-OK           VALUE '00'.
           88  FS-VTAS-IND-FIN          VALUE '10'.
		   88  FS-VTAS-IND-NO-EXIST		VALUE '23'.			   
		   
       01  FS-VTAS-ORD					PIC X(02).
           88  FS-VTAS-ORD-FIN          VALUE '10'.
	   
	   01  WS-FILE-STATUS.
           05  WS-FS                    PIC X(02).
           05  WS-FS-NOMBRE             PIC X(08).
           05  WS-FS-FUNCION            PIC X(05).

       01	FECHA.
   		   03 FECHA-AA   				PIC 9(02).
		   03 FECHA-MM					PIC 9(02).
		   03 FECHA-DD					PIC 9(02).
			   
       01	ENCABEZADO-HOJA.
		   03 FILLER					PIC X(06)
										VALUE 'Fecha '.
		   03 ENC-FECHA-DD				PIC 99.
		   03 FILLER					PIC X 
										VALUE '/'.
		   03 ENC-FECHA-MM				PIC 99.
		   03 FILLER					PIC X 
										VALUE '/'.
		   03 FILLER 					PIC X(02) 
										VALUE '20'.
	       03 ENC-FECHA-AA				PIC 99.
		   03 FILLER					PIC X(57).
		   03 FILLER					PIC X(5) 
										VALUE 'Hoja '.
		   03 ENC-N-HOJA				PIC 99.		   

       01	PIE-CLI-TOTAL.
		   03 FILLER					PIC X(54) VALUE SPACES.
		   03 FILLER					PIC X(16) 
										VALUE 'Importe total:  '.
		   03 PIE-CLIENTE-TOTAL			PIC $Z(06),99.

       01	PIE-CLI-PORCENTAJE.
		   03 FILLER					PIC X(12). 
		   03 FILLER                    PIC X(16)
										VALUE 'Porc. Descuento '.
		   03 PIE-CLIENTE-PORC			PIC 9(06)V99.
		   03 FILLER 					PIC X VALUE '%'.
		   03 FILLER					PIC X(17) VALUE SPACES.
		   03 FILLER					PIC X(16) 
										VALUE 'Importe Desc:   '.
		   03 PIE-CLIENTE-DES			PIC $Z(06),99.
		   
       01	PIE-CLI-FINAL.
		   03 FILLER					PIC X(54) VALUE SPACES.
		   03 FILLER 					PIC X(16) 
										VALUE 'Total con Desc: '.
		   03 PIE-CLIENTE-TOTAL-FINAL	PIC $Z(06),99.

       01	PIE-FECHA-TOTAL.
		   03 FILLER					PIC X(54) VALUE SPACES.
		   03 FILLER					PIC X(16) 
										VALUE 'Importe total:  '.
		   03 PIE-FEC-TOTAL				PIC $Z(06),99.

       01	PIE-FECHA-PORCENTAJE.
		   03 FILLER					PIC X(12). 
		   03 FILLER                    PIC X(16)
										VALUE 'Porc. Descuento '.
		   03 PIE-FEC-PORC			PIC 9(06)V99.
		   03 FILLER 					PIC X VALUE '%'.
		   03 FILLER					PIC X(17) VALUE SPACES.
		   03 FILLER					PIC X(16) 
										VALUE 'Importe Desc:   '.
		   03 PIE-FEC-DES			PIC $Z(06),99.
		   
       01	PIE-FECHA-FINAL.
		   03 FILLER					PIC X(54) VALUE SPACES.
		   03 FILLER 					PIC X(16) 
										VALUE 'Total con Desc: '.
		   03 PIE-FEC-TOTAL-FINAL	PIC $Z(06),99.
		   
	   01  LISTADO-LINEA.
		   03 FILLER					PIC X(08).
		   03 LIST-NRO-VTA				PIC 9(03).
		   03 FILLER					PIC X(08).
		   03 LIST-COD-MICRO			PIC 9(06).
		   03 FILLER					PIC X(08).
		   03 LIST-COD-TRAMO			PIC 9(04).
		   03 FILLER					PIC X(06).
		   03 LIST-FEC-PART				PIC X(10).
		   03 FILLER					PIC X(05).
		   03 LIST-HORA-PART			PIC X(05).		   
		   03 FILLER 					PIC X(05).
		   03 LIST-IMPORTE				PIC $Z(06),99.

	   01 LINEA-AUX						PIC X(80).
	   01 CONTADOR-LINEAS				PIC 9(03) VALUE ZEROES.
		   
       01 PARAM-CLI-MAY-REG.
		  03 CLI-MAY-COD			  PIC 9(11).
		  03 CLI-MAY-CUIT			  PIC 9(11).
		  03 CLI-MAY-RAZON			  PIC X(30).
		  03 CLI-MAY-DOMICILIO	      PIC X(30).
		  03 CLI-MAY-PORC-DESC		  PIC 9(02)V99.

	   01 PARAM.
          03 P-OP                     PIC X.
          03 P-RETORNO                PIC X(2).
          03 P-TIPO-IDEN              PIC 9.
          03 P-NRO-IDEN               PIC 9(11).
	   
       01 WS-NRO-VTA-CLI				PIC 9(03).	   

	   01 WS-RAZON-SOCIAL				PIC X(30).
	   01 WS-FECHA						PIC X(10).
	   01 WS-TOTAL-IMP					PIC 9(06)V99.
	   01 WS-TOTAL-DESC					PIC 9(06)V99.
	   01 WS-TOTAL-FINAL				PIC 9(06)V99.
	   01 WS-TOTAL-IMP-F				PIC 9(06)V99.
	   01 WS-TOTAL-DESC-F				PIC 9(06)V99.
	   01 WS-TOTAL-FINAL-F				PIC 9(06)V99.
	   
       PROCEDURE DIVISION.
      **************************************************************
      *                  PROCESO-PRINCIPAL                         *
      **************************************************************
      * 

       PPAL.
	   
			SORT VTAS-ORD 
			ON ASCENDING KEY VTAS-ORD-REG
			INPUT PROCEDURE IS PROCESO-INPUT
			OUTPUT PROCEDURE IS PROCESO-OUTPUT.
			
			STOP RUN.

      **************************************************************
      *                  PROCESO-INPUT                             *
      **************************************************************
      * 
	   
	   PROCESO-INPUT.
			PERFORM INICIO-IN.
			PERFORM PROCESAR-VTAS-SEC UNTIL FS-VTAS-SEC-FIN.
			PERFORM FIN-IN.

       PROCESAR-VTAS-SEC.
			PERFORM CONSULTA-MAYORISTA.
			PERFORM REGISTRAR-VTAS-INDEX.
			PERFORM ARMAR-REGISTRO-ORDENADO.
			RELEASE VTAS-ORD-REG.
			PERFORM LEER-VTAS-SEC.
			
	   ARMAR-REGISTRO-ORDENADO.
			MOVE WS-NRO-VTA-CLI TO VTAS-ORD-NRO-VTA.
			MOVE VTAS-SEC-FECHA TO VTAS-ORD-FECHA.
			MOVE CLI-MAY-RAZON TO VTAS-ORD-RAZON.
			MOVE CLI-MAY-CUIT TO VTAS-ORD-CUIT-CLI.
			MOVE VTAS-SEC-COD-MICRO TO VTAS-ORD-COD-MICRO.
			MOVE VTAS-SEC-COD-TRAMO TO VTAS-ORD-COD-TRAMO.
			MOVE VTAS-SEC-FECHA-PART TO VTAS-ORD-FECHA-PART.
			MOVE VTAS-SEC-HORA-PART TO VTAS-ORD-HORA-PART.
			MOVE CLI-MAY-DOMICILIO TO VTAS-ORD-DOMICILIO.
		    MOVE VTAS-SEC-IMPORTE TO VTAS-ORD-IMPORTE.
		    MOVE CLI-MAY-PORC-DESC TO VTAS-ORD-PORC-DESC.
			DISPLAY VTAS-ORD-REG.
	   
	   REGISTRAR-VTAS-INDEX.
			PERFORM ARMAR-CLAVE.
			MOVE ZEROES TO WS-TOTAL-IMP.
			START 	VTAS-INDEX 
					KEY IS > VTAS-INDEX-CLAVE 
					INVALID KEY 
					DISPLAY "PROCESA EL ERROR"
					PERFORM PROCESAR-ERROR-VTAS-INDEX
			END-START.

			IF FS-VTAS-INDEX EQUAL '00' THEN
				DISPLAY "CICLO READ INDEX"
				READ VTAS-INDEX NEXT RECORD 
					AT END SET FS-VTAS-IND-FIN TO TRUE
				END-READ

				PERFORM PROCESAR-VTAS-INDEX 
					UNTIL FS-VTAS-IND-FIN 
					OR CLI-MAY-CUIT NOT EQUAL VTAS-INDEX-CUIT-CLI
					OR VTAS-SEC-FECHA NOT EQUAL VTAS-INDEX-FECHA
					OR VTAS-INDEX-NRO-VTA-CLI EQUAL 999
			END-IF.
					
			MOVE CLI-MAY-CUIT TO VTAS-INDEX-CUIT-CLI.
			MOVE VTAS-SEC-FECHA TO VTAS-INDEX-FECHA.

			PERFORM COMPLETAR-REG-VTAS-INDEX.		
			PERFORM GUARDAR-REG-VTAS-INDEX.
			PERFORM COMPLETAR-REG-VTAS-INDEX-TOTAL.
			PERFORM GUARDAR-REG-VTAS-INDEX.
	   
       GUARDAR-REG-VTAS-INDEX.
			WRITE VTAS-INDEX-REG INVALID KEY REWRITE VTAS-INDEX-REG.
			IF FS-VTAS-INDEX NOT EQUAL '00'
				MOVE FS-VTAS-INDEX TO WS-FS
				MOVE "VTAS-INDEX" TO WS-FS-NOMBRE
				MOVE "GUARDAR" TO WS-FS-FUNCION
				PERFORM CHECK-FILE-STATUS
			END-IF.
			
	   COMPLETAR-REG-VTAS-INDEX.
			MOVE ZEROES TO VTAS-INDEX-IMPORTE.
			MOVE VTAS-SEC-IMPORTE TO VTAS-INDEX-IMPORTE.
			MOVE WS-NRO-VTA-CLI TO VTAS-INDEX-NRO-VTA-CLI.
	  
	  COMPLETAR-REG-VTAS-INDEX-TOTAL.
			COMPUTE VTAS-INDEX-IMPORTE = 
					WS-TOTAL-IMP + VTAS-SEC-IMPORTE.
			MOVE 999 TO VTAS-INDEX-NRO-VTA-CLI.
			
	   PROCESAR-ERROR-VTAS-INDEX.
			IF FS-VTAS-INDEX EQUAL "23"
				MOVE 1 TO WS-NRO-VTA-CLI
			ELSE
				MOVE FS-VTAS-INDEX  TO  WS-FS
				MOVE "VTAS-INDEX"   TO  WS-FS-NOMBRE
				MOVE "LECTURA"      TO  WS-FS-FUNCION
				PERFORM CHECK-FILE-STATUS
			END-IF.
			
	   PROCESAR-VTAS-INDEX.
			IF VTAS-INDEX-NRO-VTA-CLI NOT EQUAL 999 THEN
				COMPUTE WS-NRO-VTA-CLI = VTAS-INDEX-NRO-VTA-CLI + 1 				
				COMPUTE WS-TOTAL-IMP = WS-TOTAL-IMP + 
						VTAS-INDEX-IMPORTE
			END-IF.
			
			READ VTAS-INDEX NEXT RECORD 
				AT END SET FS-VTAS-IND-FIN TO TRUE.
			
	   ARMAR-CLAVE.
			MOVE CLI-MAY-CUIT TO VTAS-INDEX-CUIT-CLI.
			MOVE VTAS-SEC-FECHA	TO VTAS-INDEX-FECHA.
			MOVE LOW-VALUE TO VTAS-INDEX-NRO-VTA-CLI.
	   
	   CONSULTA-MAYORISTA.
			MOVE  'R' TO P-OP.
			MOVE  VTAS-TIPO-IDENT  TO P-TIPO-IDEN.
			MOVE  VTAS-IDENT-CLI  TO P-NRO-IDEN.
			DISPLAY "CALL TP2SUB R".
			CALL  "TP2SUB" USING PARAM, PARAM-CLI-MAY-REG.
			DISPLAY "RETORNO: " P-RETORNO.
			IF P-RETORNO NOT EQUAL "00"
				MOVE P-RETORNO TO WS-FS
				MOVE "CLI-MAY" TO WS-FS-NOMBRE
				MOVE "CONSULTA" TO WS-FS-FUNCION
				PERFORM CHECK-FILE-STATUS
			END-IF.
			
	   INICIO-IN.
			OPEN INPUT VTAS-SEC.
			MOVE FS-VTAS-SEC  TO  WS-FS.
			MOVE "VTAS-TXT"   TO  WS-FS-NOMBRE.
			MOVE "ABRIR"      TO  WS-FS-FUNCION.
			PERFORM CHECK-FILE-STATUS.
			DISPLAY 'VENTAS TXT ABIERTO'.	

			OPEN I-O VTAS-INDEX.
			MOVE FS-VTAS-INDEX  TO  WS-FS.
			MOVE "VTAS-IND"     TO  WS-FS-NOMBRE.
			MOVE "ABRIR"        TO  WS-FS-FUNCION.
			PERFORM CHECK-FILE-STATUS.
			DISPLAY 'VENTAS INDEXADO ABIERTO'.	

		    MOVE  'O' TO P-OP.
		    DISPLAY "CALL TP2SUB O".
   	   	    CALL  "TP2SUB" USING PARAM, PARAM-CLI-MAY-REG.
			MOVE P-RETORNO TO WS-FS.
			MOVE "CLI-MAY"	TO WS-FS-NOMBRE.
			MOVE "ABRIR" TO WS-FS-FUNCION.
			DISPLAY 'CLIENTES MAYORISTA ABIERTO'.

			PERFORM LEER-VTAS-SEC.
		
       LEER-VTAS-SEC.
			DISPLAY 'LEYO EL DE TEXTO'.

			READ VTAS-SEC AT END SET FS-VTAS-SEC-FIN  TO TRUE.
			
			IF NOT FS-VTAS-SEC-OK AND NOT FS-VTAS-SEC-FIN
				DISPLAY FS-VTAS-SEC
				DISPLAY 'ERROR AL INTETAR LEER VTAS SECUENCIAL'
				PERFORM CANCELAR-PROGRAMA
			END-IF.
		
		
       CHECK-FILE-STATUS.
           IF WS-FS NOT EQUAL "00"
              DISPLAY "CANCELACION POR ERROR"
              DISPLAY "EN ARCHIVO: " WS-FS-NOMBRE
              DISPLAY "FILSTATUS: " WS-FS
              DISPLAY "AL INTENTAR: " WS-FS-FUNCION
              PERFORM CANCELAR-PROGRAMA
           END-IF.
		   
       FIN-IN.
			CLOSE VTAS-SEC.
			CLOSE VTAS-INDEX.
			MOVE "C" TO P-OP.
			DISPLAY "CALL TP2SUB C".
			CALL  "TP2SUB" USING PARAM, PARAM-CLI-MAY-REG.
			
       CANCELAR-PROGRAMA.
			PERFORM FIN-IN.
			DISPLAY "SALIDA POR CANCELACION DE PROGRAMA".

      **************************************************************
      *                  PROCESO-OUTPUT                            *
      **************************************************************
      * 
	   PROCESO-OUTPUT.
	   
			PERFORM INICIO-OUT.
			PERFORM PROCESAR-ORDENADO UNTIL FS-VTAS-ORD-FIN.
			PERFORM FIN-OUT.
			
	   INICIO-OUT.
			OPEN OUTPUT LISTADO.
			PERFORM LEER-VTAS-ORD.
	   
	   FIN-OUT.
			CLOSE LISTADO.
		
	   LEER-VTAS-ORD.
			RETURN VTAS-ORD AT END SET FS-VTAS-ORD-FIN  TO TRUE.
			
	   PROCESAR-ORDENADO.
			
			PERFORM INIT-DATOS-CLIENTE.
			PERFORM IMPRIMIR-ENCABEZADO-CLIENTE.
		
			PERFORM PROCESAR-CLIENTE 
					UNTIL FS-VTAS-ORD-FIN 
					OR (WS-RAZON-SOCIAL NOT = VTAS-ORD-RAZON).
			
			PERFORM CALCULAR-TOTALES.
			PERFORM IMPRIMIR-FIN-CLIENTE.		
	   
	   IMPRIMIR-ENCABEZADO-CLIENTE.

			PERFORM ARMAR-ENCABEZADO-PAGINA.
			PERFORM IMPRIMIR-LINEA.
			PERFORM IMPRIMIR-LINEA-VACIA.
			
			STRING  '                  Listado de '
				    'facturacion por cliente y fecha'
					DELIMITED BY SIZE INTO LINEA.
			PERFORM IMPRIMIR-LINEA.
			PERFORM IMPRIMIR-LINEA-VACIA.
			
			STRING '     CUIT: ' VTAS-ORD-CUIT-CLI
				   '  Razon Social: ' VTAS-ORD-RAZON
				    DELIMITED BY SIZE INTO LINEA.
		    PERFORM IMPRIMIR-LINEA.
			STRING '                        Domicilio   : '
					VTAS-ORD-DOMICILIO 
					DELIMITED BY SIZE INTO LINEA.
			PERFORM IMPRIMIR-LINEA.
	   
	   IMPRIMIR-FIN-CLIENTE.
			PERFORM IMPRIMIR-LINEA-VACIA.
			MOVE VTAS-ORD-PORC-DESC TO PIE-CLIENTE-PORC.
			MOVE WS-TOTAL-IMP TO PIE-CLIENTE-TOTAL.
			MOVE WS-TOTAL-DESC TO PIE-CLIENTE-DES.
			MOVE WS-TOTAL-FINAL TO PIE-CLIENTE-TOTAL-FINAL.
			MOVE PIE-CLI-TOTAL TO LINEA.
			PERFORM IMPRIMIR-LINEA.
			MOVE PIE-CLI-PORCENTAJE TO LINEA.
			PERFORM IMPRIMIR-LINEA.
			MOVE PIE-CLI-FINAL TO LINEA.
			PERFORM IMPRIMIR-LINEA.
			PERFORM IMPRIMIR-LINEA-VACIA.
			
	   CALCULAR-TOTALES.
	   
			COMPUTE WS-TOTAL-DESC = 
				(WS-TOTAL-IMP * VTAS-ORD-PORC-DESC) / 100;
			COMPUTE WS-TOTAL-FINAL = WS-TOTAL-IMP - WS-TOTAL-DESC.
	   
	   PROCESAR-CLIENTE.	
			
			MOVE VTAS-ORD-FECHA TO WS-FECHA.
			PERFORM IMPRIMIR-ENCABEZADO-FECHA.
		    PERFORM INIT-DATOS-FECHA.

			PERFORM PROCESAR-FECHA 
					UNTIL FS-VTAS-ORD-FIN 
					OR (WS-RAZON-SOCIAL NOT = VTAS-ORD-RAZON)
					OR (WS-FECHA NOT = VTAS-ORD-FECHA).

			PERFORM CALCULAR-TOTALES-FECHA.
			PERFORM IMPRIMIR-FIN-FECHA.
					
	   IMPRIMIR-ENCABEZADO-FECHA.
			PERFORM IMPRIMIR-LINEA-VACIA.
			STRING '     FECHA: ' WS-FECHA 
				   DELIMITED BY SIZE INTO LINEA.
			PERFORM IMPRIMIR-LINEA.
			STRING '     NRO-VENTA    COD-MICRO    COD-TRAMO  '
				   '  FEC-PART    HORA-PART    IMPORTE '
				  DELIMITED BY SIZE	INTO LINEA.
		    PERFORM IMPRIMIR-LINEA.
			STRING '----------------------------------------'
				   '----------------------------------------'
				   DELIMITED BY SIZE INTO LINEA.	
			PERFORM IMPRIMIR-LINEA.
	   
	   PROCESAR-FECHA.
			PERFORM IMPRIMIR-DATOS-FECHA.
			COMPUTE WS-TOTAL-IMP = VTAS-ORD-IMPORTE + WS-TOTAL-IMP.
            COMPUTE WS-TOTAL-IMP-F = 
					VTAS-ORD-IMPORTE + WS-TOTAL-IMP-F.			
			PERFORM LEER-VTAS-ORD.

	   CALCULAR-TOTALES-FECHA.
			COMPUTE WS-TOTAL-DESC-F = 
				(WS-TOTAL-IMP-F * VTAS-ORD-PORC-DESC) / 100;
			COMPUTE WS-TOTAL-FINAL-F = 
				WS-TOTAL-IMP-F - WS-TOTAL-DESC-F.
			
	   INIT-DATOS-FECHA.
			MOVE ZEROES TO WS-TOTAL-IMP-F.
			MOVE ZEROES TO WS-TOTAL-DESC-F.
			MOVE ZEROES TO WS-TOTAL-FINAL-F.
			
	   IMPRIMIR-DATOS-FECHA.		
			
			MOVE VTAS-ORD-NRO-VTA TO LIST-NRO-VTA.
			MOVE VTAS-ORD-COD-MICRO TO LIST-COD-MICRO.
			MOVE VTAS-ORD-COD-TRAMO TO LIST-COD-TRAMO.
			MOVE VTAS-ORD-FECHA-PART TO LIST-FEC-PART.
			MOVE VTAS-ORD-HORA-PART TO LIST-HORA-PART.		   
			MOVE VTAS-ORD-IMPORTE TO LIST-IMPORTE.
	   		MOVE LISTADO-LINEA TO LINEA.
			PERFORM IMPRIMIR-LINEA.

	   IMPRIMIR-FIN-FECHA.
			PERFORM IMPRIMIR-LINEA-VACIA.
			MOVE VTAS-ORD-PORC-DESC TO PIE-FEC-PORC.
			MOVE WS-TOTAL-IMP-F TO PIE-FEC-TOTAL.
			MOVE WS-TOTAL-DESC-F TO PIE-FEC-DES.
			MOVE WS-TOTAL-FINAL-F TO PIE-FEC-TOTAL-FINAL.
			MOVE PIE-FECHA-TOTAL TO LINEA.
			PERFORM IMPRIMIR-LINEA.
			MOVE PIE-FECHA-PORCENTAJE TO LINEA.
			PERFORM IMPRIMIR-LINEA.
			MOVE PIE-FECHA-FINAL TO LINEA.
			PERFORM IMPRIMIR-LINEA.
			PERFORM IMPRIMIR-LINEA-VACIA.
			
	   INIT-DATOS-CLIENTE.
			MOVE VTAS-ORD-RAZON TO WS-RAZON-SOCIAL.
			MOVE ZEROES TO WS-TOTAL-IMP.
			MOVE ZEROES TO WS-TOTAL-DESC.
			MOVE ZEROES TO WS-TOTAL-FINAL.
			
	   IMPRIMIR-LINEA.
			IF CONTADOR-LINEAS EQUAL 60
				PERFORM IMPRIMIR-SALTO-PAGINA.
			WRITE LINEA.
			ADD 1 TO CONTADOR-LINEAS.
			
	   IMPRIMIR-LINEA-VACIA.
			MOVE SPACES TO LINEA.
			WRITE LINEA.	   
			ADD 1 TO CONTADOR-LINEAS.
			
	   IMPRIMIR-SALTO-PAGINA.
			MOVE LINEA TO LINEA-AUX.
			PERFORM ARMAR-ENCABEZADO-PAGINA.
           	WRITE LINEA.
			PERFORM IMPRIMIR-LINEA-VACIA.			
			MOVE LINEA-AUX TO LINEA.

	   ARMAR-ENCABEZADO-PAGINA.
			PERFORM ARMAR-FECHA.
			ADD 1 TO ENC-N-HOJA.
			MOVE ZEROES TO CONTADOR-LINEAS.
			MOVE ENCABEZADO-HOJA TO LINEA.

	   ARMAR-FECHA.
			ACCEPT FECHA FROM DATE.
			MOVE FECHA-DD TO ENC-FECHA-DD.
			MOVE FECHA-MM TO ENC-FECHA-MM.
			MOVE FECHA-AA TO ENC-FECHA-AA.	