       IDENTIFICATION DIVISION.
	   PROGRAM-ID.   "HOLA MUNDO"
	   
	  *
       ENVIRONMENT DIVISION.
	   CONFIGURATION SECTION.
       SOURCE-COMPUTER. RM-COBOL-85.
       OBJECT-COMPUTER. RM-COBOL-85.
	   
	   DATA DIVISION.
	   FILE SECTION.
	   
	   PROCEDURE DIVISION.
	   
	   MAIN-LOGIC SECTION.
	   BEGIN.
			DISPLAY " " LINE 1 POSITION 1 ERASE EOS.
			DISPLAY "Hola Mundo" LINE 15 POSITION 10.
			STOP RUN.
	   MAIN-LOGIC-EXIT
			EXIT
