       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLI2IDX.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
	      DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
		SELECT  CLI-IDX	ASSIGN TO "..\CLIIDX.DAT" 
				ORGANIZATION IS INDEXED
				ACCESS MODE IS RANDOM
				RECORD KEY IS CLI-IDX-CLAVE
				ALTERNATE RECORD KEY IS CLI-IDX-CLAVE-ALT
				FILE STATUS IS FS-CLI-IDX.

		SELECT CLI ASSIGN TO "..\ARCHSTXT\CLI.TXT"
				ORGANIZATION IS LINE SEQUENTIAL
				FILE STATUS IS FS-CLI.
       
	   DATA DIVISION.
       FILE SECTION.

       FD  CLI-IDX. 
       01  CLI-IDX-REG.
		   03 CLI-IDX-CLAVE.
			   05 CLI-IDX-NUMERO				PIC X(08).
		   03 CLI-IDX-FEC-ALTA.
			   05  CLI-IDX-FEC-ALTA-AA	    	PIC 9(04).
			   05  CLI-IDX-FEC-ALTA-MM 			PIC 9(02).
			   05  CLI-IDX-FEC-ALTA-DD 			PIC 9(02).
		   03  CLI-IDX-TELEFONO            		PIC X(20).
		   03  CLI-IDX-DIRECCION           		PIC X(30).
		   03  CLI-IDX-CLAVE-ALT.
               05  CLI-IDX-DOCUMENTO            PIC X(20).
		
       FD  CLI. 
       01  CLI-REG.
		   03 CLI-CLAVE.
			   05 CLI-NUMERO					PIC X(08).
		   03 CLI-FEC-ALTA.
			   05  CLI-FEC-ALTA-AA		    	PIC 9(04).
			   05  CLI-FEC-ALTA-MM 				PIC 9(02).
			   05  CLI-FEC-ALTA-DD 				PIC 9(02).
		   03  CLI-TELEFONO            			PIC X(20).
		   03  CLI-DIRECCION           			PIC X(30).
           03  CLI-DOCUMENTO     		       	PIC X(20).
       
       WORKING-STORAGE SECTION.

       01  FS-CLI								PIC X(02).
           88  FS-CLI-OK						VALUE '00'.
           88  FS-CLI-FIN						VALUE '10'.
		
	   01  FS-CLI-IDX							PIC X(02).
           88  FS-CLI-IDX-OK           			VALUE '00'.
           88  FS-CLI-IDX-FIN          			VALUE '10'.
		   88  FS-CLI-IDX-NO-EXIST				VALUE '23'.	

	   01  WS-FILE-STATUS.
           05  WS-FS                    		PIC X(02).
           05  WS-FS-NOMBRE             		PIC X(08).
           05  WS-FS-FUNCION            		PIC X(05).
		   

       PROCEDURE DIVISION.

       PGM.
		
		PERFORM 100-INICIO.
		
		PERFORM 300-LEER-CLI.
		
		PERFORM 200-PROCESO UNTIL FS-CLI-FIN.
		
		STOP RUN.
       
	   100-INICIO.
	   		OPEN OUTPUT CLI-IDX.
			MOVE FS-CLI-IDX  	TO  WS-FS.
			MOVE "CLI-IDX"      TO  WS-FS-NOMBRE.
			MOVE "ABRIR"        TO  WS-FS-FUNCION.
			PERFORM 900-CHECK-FILE-STATUS.
      *			DISPLAY 'CLI IDX ABIERTO'.		

			OPEN INPUT CLI.
			MOVE FS-CLI			TO  WS-FS.
			MOVE "CLI"		   	TO  WS-FS-NOMBRE.
			MOVE "ABRIR"      	TO  WS-FS-FUNCION.
			PERFORM 900-CHECK-FILE-STATUS.
      *			DISPLAY 'CLI ABIERTO'.		
			
       200-PROCESO.
			DISPLAY "PROCESO.".
			MOVE CLI-REG TO CLI-IDX-REG.
			
			DISPLAY CLI-IDX-REG.		
			WRITE CLI-IDX-REG.
			
			IF NOT FS-CLI-IDX-OK
				DISPLAY 'ERROR AL GUARDAR EL REGISTRO'
				GO 999-CANCELAR-PROGRAMA
			END-IF.
			
			PERFORM 300-LEER-CLI.
			

	   300-LEER-CLI.
	   		
      *			DISPLAY 'LEER-CLI'.
			READ CLI AT END SET FS-CLI-FIN  TO TRUE.
			
			IF NOT FS-CLI-OK AND NOT FS-CLI-FIN
				DISPLAY "FILE STATUS: " FS-CLI
				DISPLAY 'ERROR AL INTENTAR LEER CLI'
				GO 999-CANCELAR-PROGRAMA
			END-IF.
		
		
       900-CHECK-FILE-STATUS.
           IF WS-FS NOT EQUAL "00"
              DISPLAY "CANCELACION POR ERROR"
              DISPLAY "EN ARCHIVO: " WS-FS-NOMBRE
              DISPLAY "FILSTATUS: " WS-FS
              DISPLAY "AL INTENTAR: " WS-FS-FUNCION
              GO 999-CANCELAR-PROGRAMA
           END-IF.
		   
       998-FIN.
			CLOSE CLI.
			CLOSE CLI-IDX.
		   
       999-CANCELAR-PROGRAMA.
		   PERFORM 998-FIN.
		   DISPLAY "SALIDA POR CANCELACION DE PROGRAMA".
