       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBTP2.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
		   SELECT  CLI-IDX	ASSIGN TO "..\CLIIDX.DAT" 
				ORGANIZATION IS INDEXED
				ACCESS MODE IS DYNAMIC
				RECORD KEY IS CLI-IDX-CLAVE
				ALTERNATE RECORD KEY IS CLI-IDX-CLAVE-ALT
				FILE STATUS IS FS-CLI-IDX.

       DATA DIVISION.
       FILE SECTION.
	   FD  CLI-IDX. 
       01  CLI-IDX-REG.
		   03 CLI-IDX-CLAVE.
			   05 CLI-IDX-NUMERO				PIC X(08).
		   03 CLI-IDX-FEC-ALTA.
			   05  CLI-IDX-FEC-ALTA-AA	    	PIC 9(04).
			   05  CLI-IDX-FEC-ALTA-MM 			PIC 9(02).
			   05  CLI-IDX-FEC-ALTA-DD 			PIC 9(02).
		   03  CLI-IDX-TELEFONO            		PIC X(20).
		   03  CLI-IDX-DIRECCION           		PIC X(30).
		   03  CLI-IDX-CLAVE-ALT.
               05  CLI-IDX-DOCUMENTO            PIC X(20).
			  
       WORKING-STORAGE SECTION.
       01  FS-CLI-IDX							PIC X(02).
           88  FS-CLI-IDX-OK           			VALUE '00'.
           88  FS-CLI-IDX-FIN          			VALUE '10'.
		   88  FS-CLI-IDX-NO-EXIST				VALUE '23'.	
		   
	   01 WS-VARIABLES.
           03  WS-OPERACION           			PIC X(10).   
		   
	   LINKAGE SECTION.
	  
	   01 PARAM.
		   03 P-OP                     				PIC X.
		   03 P-RETORNO                				PIC X(2).
		   03 P-TIPO-IDEN              				PIC 9.
		   03 P-CLI-NUM                				PIC X(8).
		   03 P-CLI-DOC                				PIC X(20).
		   03 P-CLI-REG.
		      07 P-CLI-IDX-CLAVE.
			     10 P-CLI-IDX-NUMERO				PIC X(08).
			  07 P-CLI-IDX-FEC-ALTA.
				  10  P-CLI-IDX-FEC-ALTA-AA	    	PIC 9(04).
				  10  P-CLI-IDX-FEC-ALTA-MM 		PIC 9(02).
				  10  P-CLI-IDX-FEC-ALTA-DD 		PIC 9(02).
			  07  P-CLI-IDX-TELEFONO            	PIC X(20).
			  07  P-CLI-IDX-DIRECCION           	PIC X(30).
			  07  P-CLI-IDX-CLAVE-ALT.
				  10  P-CLI-IDX-DOCUMENTO           PIC X(20).   
       	   
       PROCEDURE DIVISION USING PARAM.
	   
       SUB-PGM-TP2.
		   DISPLAY 'SUB-PGM-TP2'.
           PERFORM 100-VALIDAR-OPERACION.
           PERFORM 200-EVALUAR-OPERACION.
		   PERFORM 999-VOLVER.
		   
       100-VALIDAR-OPERACION.
           IF P-OP NOT EQUAL "O" AND P-OP NOT EQUAL "o" AND
		      P-OP NOT EQUAL "C" AND P-OP NOT EQUAL "c" AND
			  P-OP NOT EQUAL "R" AND P-OP NOT EQUAL "r" THEN 
			   MOVE  99 TO P-RETORNO
			   DISPLAY 'VALIDAR-OP ER: ' P-OP
			   PERFORM 999-VOLVER
		   END-IF.
		   
	   200-EVALUAR-OPERACION.
	       IF (P-OP = 'O' OR P-OP = 'o' ) THEN
		      MOVE "OPEN" TO WS-OPERACION
		      PERFORM 300-ABRIR
	   
		   ELSE IF (P-OP = 'C' OR P-OP = 'c' ) THEN
		      MOVE "CLOSE" TO WS-OPERACION
			  PERFORM 400-CERRAR
		
		   ELSE IF (P-OP = 'R' OR P-OP = 'r' ) THEN
		      MOVE "READ" TO WS-OPERACION
			  PERFORM 500-EVALUAR-LEER
			  PERFORM 510-GUARDAR-CLI-REG-RET
		   END-IF.   
	   
	   300-ABRIR.
           OPEN I-O CLI-IDX.
           PERFORM 900-CHECK-FILE-STATUS.
	   
	   400-CERRAR.
	       CLOSE CLI-IDX.
		   PERFORM 900-CHECK-FILE-STATUS.   
	      
       500-EVALUAR-LEER.
		   DISPLAY 'ENTRA AL LEER'
	       IF (P-TIPO-IDEN NOT EQUAL 1 AND 
		       P-TIPO-IDEN NOT EQUAL 2) THEN
		      MOVE 99 TO P-RETORNO
		   ELSE
		      PERFORM 520-LIMPIAR-REG
		   	  IF P-TIPO-IDEN = 1 THEN
		         MOVE P-CLI-NUM TO P-CLI-IDX-NUMERO
				 PERFORM 540-BUSCAR-POR-CLI-NUM

			  ELSE IF P-TIPO-IDEN = 2 THEN
			     MOVE P-CLI-DOC TO P-CLI-IDX-DOCUMENTO
				 PERFORM 550-BUSCAR-POR-CLI-NUM
			  END-IF			  
		   END-IF.
   
       510-GUARDAR-CLI-REG-RET.
		   DISPLAY CLI-IDX-REG.
           MOVE  CLI-IDX-REG TO P-CLI-REG.
		   
       520-LIMPIAR-REG.
	       MOVE ZEROES   TO  P-CLI-IDX-NUMERO.
		   MOVE ZEROES   TO  P-CLI-IDX-FEC-ALTA.
           MOVE SPACES   TO  P-CLI-IDX-TELEFONO.
		   MOVE SPACES   TO  P-CLI-IDX-DIRECCION.
		   MOVE ZEROES   TO  P-CLI-IDX-DOCUMENTO.
		
       540-BUSCAR-POR-CLI-NUM.
	       START CLI-IDX 
				KEY NOT < CLI-IDX-CLAVE
				NOT INVALID KEY SET FS-CLI-IDX-OK TO TRUE.
		   PERFORM 800-LEER-IDX.
		   
       550-BUSCAR-POR-CLI-NUM.	   
	       START CLI-IDX 
				KEY NOT < CLI-IDX-CLAVE-ALT
				NOT INVALID KEY SET FS-CLI-IDX-OK TO TRUE.
		   PERFORM 800-LEER-IDX.
		   
	   800-LEER-IDX.		   
	       IF FS-CLI-IDX-OK
			  READ CLI-IDX NEXT RECORD
		   ELSE
	  	      IF FS-CLI-IDX  EQUAL '23'
			     MOVE FS-CLI-IDX TO P-RETORNO
				 PERFORM 999-VOLVER
			  ELSE
			     PERFORM 900-CHECK-FILE-STATUS
			  END-IF
		   END-IF.
		  		 
	   900-CHECK-FILE-STATUS.
           IF FS-CLI-IDX NOT EQUAL '00'
	          MOVE FS-CLI-IDX TO P-RETORNO
              PERFORM 999-VOLVER
		   ELSE
		      MOVE FS-CLI-IDX TO P-RETORNO
           END-IF.
		   
	   999-VOLVER.
		   DISPLAY 'FIN TP2SUB'.
	       GOBACK.
