       IDENTIFICATION DIVISION.
       PROGRAM-ID. TP2SUB.
      * Cuidado con las columnas (el * va en la 7 y la D de DATA en la 8)
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CLI-MAY-IDX ASSIGN TO "ARCH-2\MAYIDX.DAT"
				ORGANIZATION IS INDEXED
				ACCESS MODE IS DYNAMIC
				RECORD KEY IS CLI-MAY-IDX-COD
				ALTERNATE RECORD KEY CLI-MAY-IDX-CUIT
				FILE STATUS IS FS-CLI-MAY-IDX.

       DATA DIVISION.
       FILE SECTION.
	   FD CLI-MAY-IDX. 
       01 CLI-MAY-IDX-REG.
		   03 CLI-MAY-IDX-CLAVE.
			   05 CLI-MAY-IDX-COD               PIC 9(11).
			   05 CLI-MAY-IDX-CUIT	            PIC 9(11).
		   03 CLI-MAY-IDX-RAZON			        PIC X(30).
		   03 CLI-MAY-IDX-DOMICILIO		        PIC X(30).
		   03 CLI-MAY-IDX-PORC-DESC		        PIC 9(02)V99.
			  
       WORKING-STORAGE SECTION.
	   01 FS-CLI-MAY-IDX				PIC X(02).
           88  FS-CLI-IND-OK            VALUE '00'.
           88  FS-CLI-IND-FIN           VALUE '10'.
		   88  FS-CLI-IND-NO-EXIST		VALUE '23'.
		   
	   01 WS-VARIABLES.
           03  WS-OPERACION           PIC X(10).   
		   
	   LINKAGE SECTION.
       01 PARAM.
          03 P-OP                     PIC X.
          03 P-RETORNO                PIC X(2).
          03 P-TIPO-IDEN              PIC 9.
          03 P-NRO-IDEN               PIC 9(11).
		  
       01 PARAM-CLI-MAY-REG.
		  03 CLI-MAY-COD			  PIC 9(11).
		  03 CLI-MAY-CUIT			  PIC 9(11).
		  03 CLI-MAY-RAZON			  PIC X(30).
		  03 CLI-MAY-DOMICILIO	      PIC X(30).
		  03 CLI-MAY-PORC-DESC		  PIC 9(02)V99.
	   
       	   
       PROCEDURE DIVISION USING PARAM, PARAM-CLI-MAY-REG.
	   
       SUB-PGM-TP2.
		   DISPLAY 'SUB-PGM-TP2'.
	       PERFORM VALIDAR-OPERACION.
	       PERFORM EVALUAR-OPERACION.
		   PERFORM VOLVER.
		   
       VALIDAR-OPERACION.
           IF P-OP NOT EQUAL "O" AND P-OP NOT EQUAL "o" AND
		      P-OP NOT EQUAL "C" AND P-OP NOT EQUAL "c"  AND
			  P-OP NOT EQUAL "R" AND P-OP NOT EQUAL "r" THEN 
			   MOVE  99 TO P-RETORNO
			   DISPLAY 'VALIDAR-OP ER: ' P-OP
			   PERFORM VOLVER
		   END-IF.
		   
	   EVALUAR-OPERACION.
	       IF (P-OP = 'O' OR P-OP = 'o' ) THEN
		      MOVE "OPEN" TO WS-OPERACION
		      PERFORM ABRIR
		   END-IF.
		   IF (P-OP = 'C' OR P-OP = 'c' ) THEN
		      MOVE "CLOSE" TO WS-OPERACION
			  PERFORM CERRAR
		   END-IF.
		   IF (P-OP = 'R' OR P-OP = 'r' ) THEN
		      MOVE "READ" TO WS-OPERACION
			  PERFORM EVALUAR-LEER
			  PERFORM GUARDAR-MAY-REG-RET
		   END-IF.
	   
       GUARDAR-MAY-REG-RET.
		   DISPLAY CLI-MAY-IDX-REG.
           MOVE  CLI-MAY-IDX-REG TO PARAM-CLI-MAY-REG.
	   
	   ABRIR.
           OPEN I-O CLI-MAY-IDX.
           PERFORM CHECK-FILE-STATUS.
		   
       EVALUAR-LEER.
		   DISPLAY 'ENTRA AL LEER'
	       IF (P-TIPO-IDEN NOT EQUAL 1 AND 
		      P-TIPO-IDEN NOT EQUAL 2) THEN
		      MOVE 99 TO P-RETORNO
		   ELSE
		      PERFORM LIMPIAR-REG
		   	  IF P-TIPO-IDEN = 1 THEN
		         MOVE P-NRO-IDEN TO CLI-MAY-IDX-COD
				 PERFORM BUSCAR-POR-IND1
			  END-IF
			  IF P-TIPO-IDEN = 2 THEN
			     MOVE P-NRO-IDEN TO CLI-MAY-IDX-CUIT
				 PERFORM BUSCAR-POR-IND2
			  END-IF
			  DISPLAY 'PARAM TIPO/NUM: ' P-TIPO-IDEN '/' P-NRO-IDEN
		   END-IF.
				   
       LIMPIAR-REG.
	       MOVE ZEROES   TO  CLI-MAY-IDX-COD.
		   MOVE ZEROES   TO  CLI-MAY-IDX-CUIT.
           MOVE SPACES   TO  CLI-MAY-IDX-RAZON.
		   MOVE SPACES   TO  CLI-MAY-IDX-DOMICILIO.
		   MOVE ZEROES   TO  CLI-MAY-IDX-PORC-DESC.
		
       BUSCAR-POR-IND1.
	       START CLI-MAY-IDX 
				KEY NOT < CLI-MAY-IDX-COD
				NOT INVALID KEY SET FS-CLI-IND-OK TO TRUE.
		   PERFORM LEER-IDX.
		   
       BUSCAR-POR-IND2.	   
	       START CLI-MAY-IDX 
				KEY NOT < CLI-MAY-IDX-CUIT
				NOT INVALID KEY SET FS-CLI-IND-OK TO TRUE.
		   PERFORM LEER-IDX.
		   
	   LEER-IDX.
		   
	       IF FS-CLI-IND-OK
			  READ CLI-MAY-IDX NEXT RECORD
		   ELSE
	  	      IF FS-CLI-MAY-IDX  EQUAL "23"
			     MOVE FS-CLI-MAY-IDX TO P-RETORNO
				 PERFORM VOLVER
			  ELSE
			     PERFORM CHECK-FILE-STATUS
			  END-IF
		   END-IF.
		  
	   CERRAR.
	       CLOSE CLI-MAY-IDX.
		   PERFORM CHECK-FILE-STATUS.
		 
	   CHECK-FILE-STATUS.
           IF FS-CLI-MAY-IDX NOT EQUAL "00"
	          MOVE FS-CLI-MAY-IDX TO P-RETORNO
              PERFORM VOLVER
		   ELSE
		      MOVE FS-CLI-MAY-IDX TO P-RETORNO
           END-IF.
		   
	   VOLVER.
		   DISPLAY 'FIN TP2SUB'.
	       GOBACK.
