       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUX-MAY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
	      DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
		SELECT  MAY-INDEX	ASSIGN TO "ARCH-2\MAYIDX.DAT" 
				ORGANIZATION IS INDEXED
				ACCESS MODE IS RANDOM
				RECORD KEY IS MAY-INDEX-COD-CLI
				ALTERNATE RECORD KEY MAY-INDEX-CUIT
				FILE STATUS IS FS-MAY-INDEX.

		SELECT MAY-SEC ASSIGN TO "ARCH-2\MAY.TXT"
				ORGANIZATION IS LINE SEQUENTIAL
				FILE STATUS IS FS-MAY-SEC.
       
	   DATA DIVISION.
       FILE SECTION.

       FD  MAY-INDEX. 
       01  MAY-INDEX-REG.
		   03 MAY-INDEX-CLAVE.
			   05 MAY-INDEX-COD-CLI		    PIC 9(11).
			   05 MAY-INDEX-CUIT			PIC X(11).
		   03 MAY-INDEX-RAZON			    PIC X(30).
		   03 MAY-INDEX-DOMICILIO		    PIC X(30).
		   03 MAY-INDEX-PORC-DESC		    PIC 9(02)V99.

       FD  MAY-SEC. 
       01  MAY-SEC-REG.
		   03 MAY-SEC-COD-CLI		        PIC 9(11).
		   03 MAY-SEC-CUIT              	PIC X(11).
		   03 MAY-SEC-RAZON			        PIC X(30).
		   03 MAY-SEC-DOMICILIO		        PIC X(30).
		   03 MAY-SEC-PORC-DESC		        PIC 9(02)V99.
		   
       WORKING-STORAGE SECTION.

       01  FS-MAY-SEC			    	PIC X(02).
           88  FS-MAY-SEC-OK           VALUE '00'.
           88  FS-MAY-SEC-FIN          VALUE '10'.
		
	   01  FS-MAY-INDEX				        PIC X(02).
           88  FS-MAY-IND-OK           VALUE '00'.
           88  FS-MAY-IND-FIN          VALUE '10'.
		   88  FS-MAY-IND-NO-EXIST		VALUE '23'.	

	   01  WS-FILE-STATUS.
           05  WS-FS                    PIC X(02).
           05  WS-FS-NOMBRE             PIC X(08).
           05  WS-FS-FUNCION            PIC X(05).
		   
	   77 NVOREGISTRO					PIC X VALUE 'N'.	   
		

       PROCEDURE DIVISION.

       PPAL.
		    PERFORM INICIO.
		    PERFORM PROCESO UNTIL FS-MAY-SEC-FIN.
		    STOP RUN.

       PROCESO.
	        DISPLAY 'PROCESO'.
			MOVE MAY-SEC-COD-CLI TO MAY-INDEX-COD-CLI.
			MOVE MAY-SEC-CUIT    TO MAY-INDEX-CUIT.
			
			MOVE MAY-SEC-RAZON TO MAY-INDEX-RAZON.
			MOVE MAY-SEC-DOMICILIO TO MAY-INDEX-DOMICILIO.
			MOVE MAY-SEC-PORC-DESC TO MAY-INDEX-PORC-DESC.
			
			DISPLAY MAY-INDEX-REG.		
			WRITE MAY-INDEX-REG.
			
			IF NOT FS-MAY-IND-OK
				DISPLAY ' ERROR AL GUARDAR EL REGISTRO'
				PERFORM CANCELAR-PROGRAMA
			END-IF.
			
			PERFORM LEER-MAY-TXT.
			
	   INICIO.
		    DISPLAY 'INICIO'.
			OPEN OUTPUT MAY-INDEX.
			MOVE FS-MAY-INDEX  TO  WS-FS.
			MOVE "MAY-IND"     TO  WS-FS-NOMBRE.
			MOVE "ABRIR"       TO  WS-FS-FUNCION.
			PERFORM CHECK-FILE-STATUS.
			DISPLAY 'MAYORISTAS INDEXADO ABIERTO'.		

			OPEN INPUT MAY-SEC.
			MOVE FS-MAY-SEC  TO  WS-FS.
			MOVE "MAY-TXT"   TO  WS-FS-NOMBRE.
			MOVE "ABRIR"     TO  WS-FS-FUNCION.
			PERFORM CHECK-FILE-STATUS.
			DISPLAY 'MAYORISTAS TXT ABIERTO'.		

			PERFORM LEER-MAY-TXT.

	   LEER-MAY-TXT.
			DISPLAY 'LEER-MAY-TXT'.
			READ MAY-SEC AT END SET FS-MAY-SEC-FIN  TO TRUE.
			
			IF NOT FS-MAY-SEC-OK AND NOT FS-MAY-SEC-FIN
				DISPLAY FS-MAY-SEC
				DISPLAY 'ERROR AL INTENTAR LEER MAY INDEX TXT'
				PERFORM CANCELAR-PROGRAMA
			END-IF.
		
		
       CHECK-FILE-STATUS.
           IF WS-FS NOT EQUAL "00"
              DISPLAY "CANCELACION POR ERROR"
              DISPLAY "EN ARCHIVO: " WS-FS-NOMBRE
              DISPLAY "FILSTATUS: " WS-FS
              DISPLAY "AL INTENTAR: " WS-FS-FUNCION
              PERFORM CANCELAR-PROGRAMA
           END-IF.
		   
       FIN.
			CLOSE MAY-SEC.
			CLOSE MAY-INDEX.
		   
       CANCELAR-PROGRAMA.
		   PERFORM FIN.
		   DISPLAY "SALIDA POR CANCELACION DE PROGRAMA".
