       IDENTIFICATION DIVISION.
       PROGRAM-ID. VTATXT-TO-INDX.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
	      DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
		SELECT  VTAS-INDEX	ASSIGN TO "ARCH-2\VTASIDX.DAT" 
				ORGANIZATION IS INDEXED
				ACCESS MODE IS RANDOM
				RECORD KEY IS VTAS-INDEX-CLAVE
				FILE STATUS IS FS-VTAS-INDEX.

		SELECT VTAS-SEC ASSIGN TO "ARCH-2\VTASTXT.TXT"
				ORGANIZATION IS LINE SEQUENTIAL
				FILE STATUS IS FS-VTAS-SEC.
       
	   DATA DIVISION.
       FILE SECTION.

       FD	VTAS-INDEX. 
       01  VTAS-INDEX-REG.
		   03 VTAS-INDEX-CLAVE.
			   05 VTAS-INDEX-CUIT-CLI		PIC 9(11).
			   05 VTAS-INDEX-FECHA			PIC X(10).
			   05 VTAS-INDEX-NRO-VTA-CLI	PIC 9(03).
		   03 VTAS-INDEX-IMPORTE			PIC 9(06)V99.

       FD	VTAS-SEC. 
       01  VTAS-SEC-REG.
		   03 VTAS-SEC-CUIT-CLI			PIC 9(11).
		   03 VTAS-SEC-FECHA			PIC X(10).
		   03 VTAS-SEC-NRO-VTA-CLI		PIC 9(03).
		   03 VTAS-SEC-IMPORTE				PIC 9(06)V99.
		
       WORKING-STORAGE SECTION.

       01  FS-VTAS-SEC					PIC X(02).
           88  FS-VTAS-SEC-OK           VALUE '00'.
           88  FS-VTAS-SEC-FIN          VALUE '10'.
		
	   01  FS-VTAS-INDEX				PIC X(02).
           88  FS-VTAS-IND-OK           VALUE '00'.
           88  FS-VTAS-IND-FIN          VALUE '10'.
		   88  FS-VTAS-IND-NO-EXIST		VALUE '23'.	

	   01  WS-FILE-STATUS.
           05  WS-FS                    PIC X(02).
           05  WS-FS-NOMBRE             PIC X(08).
           05  WS-FS-FUNCION            PIC X(05).
		   
	   77 NVOREGISTRO					PIC X VALUE 'N'.	   
		

       PROCEDURE DIVISION.

       PPAL.
		
		PERFORM INICIO.
		
		PERFORM PROCESO UNTIL FS-VTAS-SEC-FIN.
		
		STOP RUN.

       PROCESO.
	  
			MOVE VTAS-SEC-CUIT-CLI TO VTAS-INDEX-CUIT-CLI.
			MOVE VTAS-SEC-FECHA	TO VTAS-INDEX-FECHA.
			MOVE VTAS-SEC-NRO-VTA-CLI TO VTAS-INDEX-NRO-VTA-CLI.

			READ VTAS-INDEX INVALID KEY MOVE 'S' TO NVOREGISTRO.
			
			MOVE VTAS-SEC-IMPORTE TO VTAS-INDEX-IMPORTE.
			
			IF NVOREGISTRO = 'S'
				DISPLAY 'ALTA REGISTRO'
				WRITE VTAS-INDEX-REG
			ELSE
					DISPLAY 'MODIFICA REGISTRO'
					REWRITE VTAS-INDEX-REG
			END-IF.
			
			IF NOT FS-VTAS-IND-OK
				   DISPLAY ' ERROR AL GUARDAR EL REGISTRO'
				   PERFORM CANCELAR-PROGRAMA
			END-IF.
			
			PERFORM LEER-VTAS-TXT.
			
	   INICIO.
	   
			OPEN I-O VTAS-INDEX.
			MOVE FS-VTAS-INDEX  TO  WS-FS.
			MOVE "VTAS-IND"     TO  WS-FS-NOMBRE.
			MOVE "ABRIR"        TO  WS-FS-FUNCION.
			PERFORM CHECK-FILE-STATUS.
			DISPLAY 'VENTAS INDEXADO ABIERTO'.		

			OPEN INPUT VTAS-SEC.
			MOVE FS-VTAS-SEC  TO  WS-FS.
			MOVE "VTAS-TXT"   TO  WS-FS-NOMBRE.
			MOVE "ABRIR"      TO  WS-FS-FUNCION.
			PERFORM CHECK-FILE-STATUS.
			DISPLAY 'VENTAS TXT ABIERTO'.		

			PERFORM LEER-VTAS-TXT.

	   LEER-VTAS-TXT.
	   		
			DISPLAY 'LEYO EL DE TEXTO'.

			READ VTAS-SEC AT END SET FS-VTAS-SEC-FIN  TO TRUE.
			
			IF NOT FS-VTAS-SEC-OK AND NOT FS-VTAS-SEC-FIN
				DISPLAY FS-VTAS-SEC
				DISPLAY 'ERROR AL INTETAR LEER VTAS INDEX TXT'
				PERFORM CANCELAR-PROGRAMA
			END-IF.
		
		
       CHECK-FILE-STATUS.
           IF WS-FS NOT EQUAL "00"
              DISPLAY "CANCELACION POR ERROR"
              DISPLAY "EN ARCHIVO: " WS-FS-NOMBRE
              DISPLAY "FILSTATUS: " WS-FS
              DISPLAY "AL INTENTAR: " WS-FS-FUNCION
              PERFORM CANCELAR-PROGRAMA
           END-IF.
		   
       FIN.
			CLOSE VTAS-SEC.
			CLOSE VTAS-INDEX.
		   
       CANCELAR-PROGRAMA.
		   PERFORM FIN.
		   DISPLAY "SALIDA POR CANCELACION DE PROGRAMA".
