       IDENTIFICATION DIVISION.
       PROGRAM-ID. IDX2CHO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
	      DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
		SELECT  CHO-IDX	ASSIGN TO "..\CHOIDX.DAT" 
				ORGANIZATION IS INDEXED
				ACCESS MODE IS SEQUENTIAL
				RECORD KEY IS CHO-IDX-CLAVE
				FILE STATUS IS FS-CHO-IDX.

		SELECT CHO ASSIGN TO "..\ARCHSTXT\CHOIDX.TXT"
				ORGANIZATION IS LINE SEQUENTIAL
				FILE STATUS IS FS-CHO.
	   DATA DIVISION.
       FILE SECTION.

       FD  CHO-IDX. 
       01  CHO-IDX-REG.
		   03 CHO-IDX-CLAVE.
			   05 CHO-IDX-LEGAJO				PIC X(07).
			   05 CHO-IDX-FECHA-DESDE.
			   	  07  CHO-IDX-FECHA-DESDE-AA    PIC 9(04).
				  07  CHO-IDX-FECHA-DESDE-MM 	PIC 9(02).
				  07  CHO-IDX-FECHA-DESDE-DD 	PIC 9(02).
		   03 CHO-IDX-FECHA-HASTA.
			   05  CHO-IDX-FECHA-HASTA-AA    	PIC 9(04).
			   05  CHO-IDX-FECHA-HASTA-MM 		PIC 9(02).
			   05  CHO-IDX-FECHA-HASTA-DD 		PIC 9(02).
		   03  CHO-IDX-TURNO            		PIC X.
		
       FD  CHO. 
       01  CHO-REG.
		   03 CHO-CLAVE.
			   05 CHO-LEGAJO					PIC X(07).
			   05 CHO-FECHA-DESDE.
			   	  07  CHO-FECHA-DESDE-AA    	PIC 9(04).
				  07  CHO-FECHA-DESDE-MM 		PIC 9(02).
				  07  CHO-FECHA-DESDE-DD 		PIC 9(02).
		   03 CHO-FECHA-HASTA.
			   05  CHO-FECHA-HASTA-AA    		PIC 9(04).
			   05  CHO-FECHA-HASTA-MM 			PIC 9(02).
			   05  CHO-FECHA-HASTA-DD 			PIC 9(02).
		   03  CHO-TURNO  						PIC X.
		
       WORKING-STORAGE SECTION.

       01  FS-CHO								PIC X(02).
           88  FS-CHO-OK						VALUE '00'.
           88  FS-CHO-FIN						VALUE '10'.
		
	   01  FS-CHO-IDX							PIC X(02).
           88  FS-CHO-IDX-OK           			VALUE '00'.
           88  FS-CHO-IDX-FIN          			VALUE '10'.
		   88  FS-CHO-IDX-NO-EXIST				VALUE '23'.	

	   01  WS-FILE-STATUS.
           05  WS-FS                    		PIC X(02).
           05  WS-FS-NOMBRE             		PIC X(08).
           05  WS-FS-FUNCION            		PIC X(05).	   
		
       PROCEDURE DIVISION.

       PGM.
		
		PERFORM 100-INICIO.
		
		PERFORM 300-LEER-CHO-IDX.
		
		PERFORM 200-PROCESO UNTIL FS-CHO-IDX-FIN.
		DISPLAY "NO LEYO UN JORACA".
		STOP RUN.

      
	   100-INICIO.
	   		OPEN INPUT CHO-IDX.
			MOVE FS-CHO-IDX  	TO  WS-FS.
			MOVE "CHO-IDX"      TO  WS-FS-NOMBRE.
			MOVE "ABRIR"        TO  WS-FS-FUNCION.
			PERFORM 900-CHECK-FILE-STATUS.
			DISPLAY 'CHO IDX ABIERTO'.		

			OPEN OUTPUT CHO.
			MOVE FS-CHO			TO  WS-FS.
			MOVE "CHO"		   	TO  WS-FS-NOMBRE.
			MOVE "ABRIR"      	TO  WS-FS-FUNCION.
			PERFORM 900-CHECK-FILE-STATUS.
			DISPLAY 'CHO ABIERTO'.		
       
	   
	   200-PROCESO.
			DISPLAY "PROCESO.".
			MOVE CHO-IDX-REG TO CHO-REG.
			
			DISPLAY CHO-REG.
			WRITE CHO-REG.
			
			IF NOT FS-CHO-OK
				DISPLAY 'ERROR AL GUARDAR EL REGISTRO'
				GO 999-CANCELAR-PROGRAMA
			END-IF.
			
			PERFORM 300-LEER-CHO-IDX.
			
       300-LEER-CHO-IDX.
	   		
			DISPLAY 'LEYO EL CHO INDEX'.

			READ CHO-IDX AT END SET FS-CHO-IDX-FIN  TO TRUE.
			DISPLAY "FS: " FS-CHO-IDX
			IF NOT FS-CHO-IDX-OK AND NOT FS-CHO-IDX-FIN THEN
				DISPLAY "FS: " FS-CHO-IDX
				DISPLAY 'ERROR AL INTETAR LEER CHO-IDX'
				GO 999-CANCELAR-PROGRAMA
			END-IF.
		
		
       900-CHECK-FILE-STATUS.
           IF WS-FS NOT EQUAL "00"
              DISPLAY "CANCELACION POR ERROR"
              DISPLAY "EN ARCHIVO: " WS-FS-NOMBRE
              DISPLAY "FILSTATUS: " WS-FS
              DISPLAY "AL INTENTAR: " WS-FS-FUNCION
              GO 999-CANCELAR-PROGRAMA
           END-IF.
		   
       998-FIN.
			CLOSE CHO.
			CLOSE CHO-IDX.
		   
       999-CANCELAR-PROGRAMA.
		   PERFORM 998-FIN.
		   DISPLAY "SALIDA POR CANCELACION DE PROGRAMA".
